Revit 2027 API
Category.GetCategory(Document, ElementId) Method
 Retrieves a category object corresponding to the category id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static Category GetCategory(
	Document document,
	ElementId categoryId
)
Public Shared Function GetCategory (
	document As Document,
	categoryId As ElementId
) As Category
public:
static Category^ GetCategory(
	Document^ document,
	ElementId^ categoryId
)
static member GetCategory :
        document : Document *
        categoryId : ElementId -> Category
Parameters
document Document
The document.
categoryId ElementId
An category id.
Return Value
Category
Returns a category object corresponding to the category id.
See Also
Reference
Category Class
GetCategory Overload
Autodesk.Revit.DB Namespace